# RebarShapeMultiplanarDefinition Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeMultiplanarDefinition Members
RebarShapeMultiplanarDefinition Class Constructors Methods Properties See Also
---
The RebarShapeMultiplanarDefinition type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeMultiplanarDefinition | Create a RebarShapeMultiplanarDefinition for use in creating a RebarShape. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RebarShapeMultiplanarDefinition |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetPresenceOfSegments | Simultaneously set the presence of all 3D segments. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DepthParamId | Id of the parameter driving the multiplanar depth. The depth is measured center-to-center of the bar. A valid shape parameter must be assigned to DepthParamId before the MultiplanarDefinition can be used in RebarShape creation. |
| IsDuplicateShapePresent | Whether the shape definition includes an offset copy of the 2D shape. |
| IsEndConnectorPresent | Whether a perpendicular segment is constructed from the end of the 2D shape. |
| IsStartConnectorPresent | Whether a perpendicular segment is constructed from the start of the 2D shape. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OutOfPlaneBendDiameter | Bend diameter to be applied to the connector segments. |

# See Also
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace